-- Заповнюємо незалежні довідники (Жанри та Автори)


INSERT INTO genres (name) VALUES 
('Українська класика'),
('Фантастика'),
('Детектив'),
('Наукова література'),
('Програмування');

INSERT INTO authors (full_name, bio) VALUES 
('Тарас Шевченко', 'Видатний український поет та художник.'),
('Джоан Роулінг', 'Британська письменниця, авторка серії романів про Гаррі Поттера.'),
('Стівен Кінг', 'Американський письменник, відомий як "Король жахів".'),
('Роберт Мартін', 'Інженер-програміст, автор серії книг про чистий код.'),
('Агата Крісті', 'Англійська письменниця, майстриня детективного жанру.');


-- Заповнюємо книги (посилаємось на ID авторів та жанрів)

INSERT INTO books (title, author_id, genre_id, isbn, published_year, total_copies, available_copies) VALUES 
('Кобзар', 1, 1, '978-966-00-0001-0', 1840, 5, 5),
('Гаррі Поттер і філософський камінь', 2, 2, '978-0-7475-3269-9', 1997, 10, 9),
('Воно', 3, 2, '978-0-670-81302-5', 1986, 3, 3),
('Чистий код', 4, 5, '978-0-13-235088-4', 2008, 7, 6),
('Вбивство у Східному експресі', 5, 3, '978-0-00-711931-8', 1934, 4, 4);



-- Реєструємо читачів

INSERT INTO readers (full_name, email, phone_number, library_card_number) VALUES 
('Олександр Петренко', 'petrenko@mail.com', '+380501112233', 'LIB-001'),
('Марія Коваль', 'm.koval@gmail.com', '+380672223344', 'LIB-002'),
('Іван Сидоренко', 'ivan.syd@ukr.net', '+380933334455', 'LIB-003');


-- Створюємо історію видач (хто що взяв)

INSERT INTO loans (book_id, reader_id, loan_date, due_date, return_date) VALUES 

(2, 1, '2023-10-01', '2023-10-15', '2023-10-14'),

(2, 2, '2023-10-25', '2023-11-10', NULL),

(4, 3, '2023-10-26', '2023-11-10', NULL);